package com.example.android.core.model

import kotlinx.serialization.Serializable

@Serializable
data class CarStore(val name: String, val address: String, val phone: String) {
    companion object {
        val stores = listOf(
            CarStore("北京一汽丰田", "北京市朝阳区东大桥路22号", "010-85668888"),
            CarStore("北京上汽大众", "北京市海淀区清华科技园中路9号", "010-62780888"),
            CarStore("北京奥迪", "北京市朝阳区东三环北路4号", "010-85968888"),
            CarStore("北京奔驰", "北京市朝阳区朝阳门南大街4号", "010-65668888"),
            CarStore("北京宝马", "北京市朝阳区朝阳北路88号", "010-85998888"),
            CarStore("北京福特", "北京市朝阳区朝外大街1号", "010-59238888"),
            CarStore("北京广汽传祺", "北京市丰台区长辛店东路68号", "010-63788888"),
            CarStore("北京吉利汽车", "北京市朝阳区东四环北路6号", "010-64758888"),
            CarStore("北京马自达", "北京市朝阳区东四环北路168号", "010-84508888"),
            CarStore("北京日产", "北京市朝阳区北苑路11号", "010-84978888"),
            CarStore("北京斯柯达", "北京市朝阳区酒仙桥路2号院2号楼", "010-84568888"),
            CarStore("北京现代", "北京市海淀区颐和园路16号", "010-62688888"),
            CarStore("哈尔滨一汽大众", "黑龙江省哈尔滨市香坊区大成街1号", "0451-53613888"),
            CarStore("沈阳一汽丰田", "辽宁省沈阳市和平区黄河北大街266号", "024-31089999"),
            CarStore("长春北方汽车", "吉林省长春市汽车产业开发区神华路5555号", "0431-81975555"),
            CarStore("大连奥迪", "辽宁省大连市甘井子区虎滩街道高新园区泛海国际广场A座1-3层", "0411-39529999"),
            CarStore("齐齐哈尔广汽传祺", "黑龙江省齐齐哈尔市建华区前进路240号", "0452-8300666"),
            CarStore("哈尔滨华德宝马", "黑龙江省哈尔滨市南岗区大成街148号", "0451-82488888"),
            CarStore("长春东风日产", "吉林省长春市南关区二道街4505号", "0431-82588888"),
            CarStore("吉林上汽大众", "吉林省长春市高新区吉林大路8888号", "0431-81808888"),
            CarStore("沈阳一汽奥迪", "辽宁省沈阳市皇姑区北陵大街1号", "024-31359999"),
            CarStore("哈尔滨奔驰", "黑龙江省哈尔滨市香坊区香坊大街288号", "0451-51998888"),
            CarStore("长春奥迪", "吉林省长春市南关区二道街4400号", "0431-85988888"),
            CarStore("齐齐哈尔奇瑞汽车", "黑龙江省齐齐哈尔市铁锋区和平街3号", "0452-8618888"),
            CarStore("沈阳奔驰", "辽宁省沈阳市和平区和平北大街68号", "024-31838888"),
            CarStore("长春宝马", "吉林省长春市南关区长春市大经路899号", "0431-88998888"),
            CarStore("大连一汽丰田", "辽宁省大连市甘井子区虎滩街道高新园区泛海国际广场A座1-3层", "0411-39529999"),
        )
    }
}